{
  "project": "PlayerARC - Phase 1.3: Import Frontend Wizard & Integration",
  "branchName": "ralph/phase-1.3-import-frontend-wizard",
  "description": "Build the generic import wizard UI with 7 steps (Upload, Map Columns, Select Players, Configure Benchmarks, Review, Import, Complete). Extract reusable components from the existing GAA import. Create the import entry page with template selection and recent imports. Add import navigation link for admins. Preserve all existing GAA import UX patterns.",
  "prdFile": "scripts/ralph/prds/Importing Members/phase-1-foundation.md",
  "contextFiles": [
    "apps/web/src/components/gaa-import.tsx",
    "packages/backend/convex/models/importTemplates.ts",
    "packages/backend/convex/models/importSessions.ts",
    "packages/backend/convex/models/playerImport.ts",
    "packages/backend/convex/lib/import/parser.ts",
    "packages/backend/convex/lib/import/mapper.ts",
    "packages/backend/convex/lib/import/validator.ts",
    "packages/backend/convex/schema.ts",
    "CLAUDE.md"
  ],
  "mandatoryPatterns": [
    "Use shadcn/ui components for all UI elements",
    "Use Tailwind CSS for styling",
    "Use useQuery/useMutation from convex/react for data fetching",
    "Lift queries to parent components - no useQuery in list item components",
    "Use query skipping when data not needed",
    "All routes scoped under /orgs/[orgId]/",
    "Support mobile viewport (375px minimum)",
    "Run npx ultracite fix before completing any story",
    "Preserve per-player selection UX from GAA import (checkbox, search, bulk actions)",
    "Use useOrgTheme hook for organization branding where appropriate"
  ],
  "successCriteria": [
    "Import wizard accessible at /orgs/[orgId]/import",
    "Template selection UI shows platform and org-specific templates",
    "Upload step supports CSV file drag-and-drop and paste",
    "Mapping step shows auto-mapped columns with confidence indicators",
    "Player selection step has checkbox, search, filter, bulk actions",
    "Benchmark config step offers 5 strategies with preview",
    "Review step shows duplicates and validation errors",
    "Import step shows real-time progress",
    "Complete step shows statistics and 'What Next' actions",
    "Admin navigation includes import link",
    "All type checks pass: npm run check-types"
  ],
  "userStories": [
    {
      "id": "US-P1.3-001",
      "title": "Create import entry page with template selection",
      "description": "As an admin, I need an import page where I can select a sport, choose a template, and start the import wizard.",
      "acceptanceCriteria": [
        "Create apps/web/src/app/orgs/[orgId]/import/page.tsx",
        "Show sport selection dropdown (query available sports from backend)",
        "Show template selection cards (platform + org templates, filtered by sport) using useQuery to importTemplates.listTemplates",
        "Show 'Start Import' button that navigates to the wizard with selected template",
        "Show recent imports list (last 5 sessions) using useQuery to importSessions.listSessionsByOrg",
        "Use shadcn/ui Card, Select, Button components",
        "Mobile responsive layout (stack cards vertically on small screens)"
      ],
      "priority": 1,
      "passes": false,
      "notes": "This is the entry point. Template selection determines which column mappings are pre-configured. If no template is selected, the wizard starts with manual mapping. Recent imports show status, date, and row count."
    },
    {
      "id": "US-P1.3-002",
      "title": "Create ImportWizard orchestrator component",
      "description": "As the import system, I need a wizard component that orchestrates the multi-step import flow with state management and step navigation.",
      "acceptanceCriteria": [
        "Create apps/web/src/components/import/ImportWizard.tsx",
        "Define 7 wizard steps: Upload, Map Columns, Select Players, Configure Benchmarks, Review, Import, Complete",
        "Manage wizard state: currentStep, template, sportCode, parsedData, mappings, playerSelections, benchmarkSettings, sessionId",
        "Show step indicator at top (numbered steps with current highlighted)",
        "Support Next/Back navigation between steps",
        "Conditional step skipping: skip Map Columns if 100% auto-mapped, skip Review if no duplicates and no errors",
        "Create import session on wizard start using useMutation to importSessions.createImportSession",
        "Pass step-specific props down to each step component"
      ],
      "priority": 2,
      "passes": false,
      "notes": "State should be lifted to this component and passed down. Each step component receives data and callbacks. The wizard does NOT use URL-based routing for steps - it's all client-side state."
    },
    {
      "id": "US-P1.3-003",
      "title": "Create UploadStep component",
      "description": "As an admin, I need to upload a CSV file or paste data from a spreadsheet to start the import.",
      "acceptanceCriteria": [
        "Create apps/web/src/components/import/steps/UploadStep.tsx",
        "File drag-and-drop zone accepting .csv files (use native HTML drag events)",
        "File input fallback button for manual file selection",
        "Clipboard paste textarea for pasting from Excel",
        "Parse uploaded/pasted content using parser.ts parseCSV function",
        "Show parsing results: header count, row count, detected delimiter",
        "Show first 3 rows as preview table",
        "Call onComplete callback with ParseResult when ready to proceed"
      ],
      "priority": 3,
      "passes": false,
      "notes": "CSV parsing happens client-side (imported from lib/import/parser.ts). Excel parsing is out of scope for Phase 1.3 - only CSV supported initially. The drag zone should show visual feedback on dragover."
    },
    {
      "id": "US-P1.3-004",
      "title": "Create MappingStep component",
      "description": "As an admin, I need to review and adjust the auto-mapped column assignments before importing.",
      "acceptanceCriteria": [
        "Create apps/web/src/components/import/steps/MappingStep.tsx",
        "Show each source column with: column name, 3 sample values, confidence badge, target field dropdown",
        "Auto-mapped columns (confidence >= 95%) show green checkmark and locked dropdown",
        "Partially matched columns (70-94%) show yellow badge with suggested mapping",
        "Unmatched columns show red badge and empty dropdown",
        "Target field dropdown includes all importable fields plus 'Don't Import' option",
        "Override button to unlock auto-mapped columns for manual adjustment",
        "Validation: show warning if required fields (firstName, lastName, dateOfBirth) are not mapped",
        "Call suggestMappings from mapper.ts on mount to compute initial mappings"
      ],
      "priority": 4,
      "passes": false,
      "notes": "The mapping UI is a table/list of rows - one per source column. Use shadcn/ui Select for dropdowns, Badge for confidence. Required fields that are unmapped should prevent proceeding to next step."
    },
    {
      "id": "US-P1.3-005",
      "title": "Create PlayerSelectionStep component",
      "description": "As an admin, I need to select which players to import using checkboxes with search and bulk actions - matching the existing GAA import UX.",
      "acceptanceCriteria": [
        "Create apps/web/src/components/import/steps/PlayerSelectionStep.tsx",
        "Show player table with checkbox per row, sortable columns (Name, DOB, Age Group, Gender, Parent Contact, Team)",
        "Select All / Deselect All bulk action buttons",
        "Search bar filtering by name, DOB, team (client-side filter)",
        "Filter tabs: All / Selected / Unselected with counts",
        "Selected count summary at top: 'X of Y players selected'",
        "All players selected by default on first render",
        "Call onComplete with Map<number, boolean> of selections when proceeding"
      ],
      "priority": 5,
      "passes": false,
      "notes": "This mirrors the existing per-player selection in gaa-import.tsx. Reference lines 1600-1800 of that file for the UX patterns. Use shadcn/ui Table, Checkbox, Input components. The search should be debounced (300ms)."
    },
    {
      "id": "US-P1.3-006",
      "title": "Create BenchmarkConfigStep component",
      "description": "As an admin, I need to configure how initial skill ratings are set for imported players.",
      "acceptanceCriteria": [
        "Create apps/web/src/components/import/steps/BenchmarkConfigStep.tsx",
        "Toggle switch: 'Initialize skill ratings during import' (default on)",
        "When enabled, show strategy radio buttons: Blank (All 1s), Middle (All 3s), Age-Appropriate (Recommended), NGB Standards, Custom Template",
        "When 'Custom Template' selected, show template selector dropdown (query benchmarkTemplates)",
        "Show preview section: sample skill ratings for the selected strategy and a sample age group",
        "Passport status checkboxes: Active (checked), Inactive (unchecked), Archived (unchecked)",
        "Use shadcn/ui Switch, RadioGroup, Select components"
      ],
      "priority": 6,
      "passes": false,
      "notes": "The preview is informational - it shows what ratings would look like for a sample U12 player. This helps admins understand the difference between strategies before committing."
    },
    {
      "id": "US-P1.3-007",
      "title": "Create ReviewStep with duplicate resolution",
      "description": "As an admin, I need to review validation errors and resolve duplicate players before importing.",
      "acceptanceCriteria": [
        "Create apps/web/src/components/import/steps/ReviewStep.tsx",
        "Show validation error summary: count of errors by type",
        "Show error table with: row number, field, error message, current value, suggested fix (if available)",
        "Show duplicate section: players that match existing records (by name+DOB)",
        "Duplicate resolution options per player: Skip (don't import), Merge (update existing), Create New",
        "Show team creation preview: list of teams that will be created",
        "Summary cards at top: X valid, Y errors, Z duplicates",
        "Allow proceeding even with errors (with confirmation dialog)"
      ],
      "priority": 7,
      "passes": false,
      "notes": "Duplicate detection is done client-side by querying existing playerIdentities. Reference gaa-import.tsx lines 2066-2265 for the existing duplicate resolution UX patterns. Use shadcn/ui Alert, Table, Dialog components."
    },
    {
      "id": "US-P1.3-008",
      "title": "Create ImportStep and CompleteStep components",
      "description": "As an admin, I need to see real-time import progress and a completion summary with next steps.",
      "acceptanceCriteria": [
        "Create apps/web/src/components/import/steps/ImportStep.tsx",
        "Show phase-by-phase progress: Creating Players, Matching Guardians, Creating Enrollments, Creating Passports, Applying Benchmarks",
        "Live counter: X of Y players processed",
        "Show current operation description",
        "Call batchImportPlayersWithIdentity mutation with all wizard data",
        "Create apps/web/src/components/import/steps/CompleteStep.tsx",
        "Show statistics cards: players created, guardians linked, teams created, passports created, benchmarks applied",
        "Show 'What Next' action cards: View Players, Start Another Import, Download Import Log",
        "Return to import page link"
      ],
      "priority": 8,
      "passes": false,
      "notes": "The import mutation is called from ImportStep. Progress tracking may need to use session status updates. If the mutation is too large for a single call, consider batching (100 players per call). Reference gaa-import.tsx lines 2554-2568 for progress tracking patterns."
    },
    {
      "id": "US-P1.3-009",
      "title": "Add import link to admin navigation",
      "description": "As an admin, I need to access the import page from the main navigation.",
      "acceptanceCriteria": [
        "Find the admin sidebar/navigation component (likely in apps/web/src/components/ or the layout file)",
        "Add 'Import Players' link pointing to /orgs/[orgId]/import",
        "Use appropriate Lucide icon (Upload or FileUp)",
        "Link visible only to admin and owner roles",
        "Link appears in the management section of navigation",
        "Typecheck passes: npm run check-types"
      ],
      "priority": 9,
      "passes": false,
      "notes": "Check the existing navigation structure to find where team management and user management links are. Place the import link near those. Use the same access control pattern as other admin-only links."
    },
    {
      "id": "US-P1.3-010",
      "title": "Integration testing of full import wizard flow",
      "description": "As a developer, I need to verify the complete import wizard works end-to-end with the backend.",
      "acceptanceCriteria": [
        "Verify: Upload CSV -> columns auto-mapped -> select players -> configure benchmarks -> review -> import -> completion",
        "Verify: Template selection pre-fills mappings correctly",
        "Verify: Player selection checkboxes, search, and bulk actions work",
        "Verify: Import mutation receives correct sportCode, sessionId, selectedRowIndices, benchmarkSettings",
        "Verify: Completion step shows accurate statistics",
        "Run npx ultracite fix",
        "Run npx -w packages/backend convex codegen",
        "Typecheck passes: npm run check-types"
      ],
      "priority": 10,
      "passes": false,
      "notes": "This is a verification story - ensure all pieces connect. Check that the wizard state flows correctly between steps and that the final mutation call includes all necessary data."
    }
  ]
}
